tutorials/compressible/nexaFoam/neTCLib/heatBath/heatBath_generic/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs 
(
    "libneTCLib_2T.so"
);

application     nexaFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1e-04;

deltaT          1e-09;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;

maxDeltaT       1e-02;

functions
{
    neReactionRates
    {
        type            ne2TSpecieReactionRates;
        libs            ("libneChemistryModel.so");

        writeControl    timeStep;
        writeInterval   1;

        // optional: restrict to a cellZone / region later if wanted
    }
    reactionTracker
    {
        type              ne2TReactionTracker;
        libs              ("libneChemistryModel.so");

        writeControl      timeStep;
        writeInterval     1;

        activityTolerance 1e-20;
        writeToLog        true;
    }
}


// ************************************************************************* //
